# Используем базовый образ Python
FROM python:3.9

# Устанавливаем переменную окружения для вывода сообщений об ошибках и вывода данных в консоль
ENV PYTHONUNBUFFERED 1

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
COPY requirements.txt /app/
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы вашего приложения внутрь контейнера
COPY . /app/

# Определяем порт, который будет использоваться приложением
EXPOSE 8000

# Команда для запуска приложения внутри контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
